USE KiMeTzion
GO

INSERT INTO dbo.TBL_REF_NIKKUD 
VALUES 
('Kammats','קמץ','אָ','U+05B8','&#1464;'),
('Patach','פתח','אַ','U+05B7','&#1463;'),
('Segol','סגל','אֶ','U+05B6','&#1462;'),
('Tsira','צירה','אֵ','U+05B5','&#1461;'),
('Chirik','חיריק','אִ','U+05B4','&#1460;'),
('Cholam Chaser','חולם חסר','אֹ','U+05BA','&#1465;'),
('Cholam','חולם','אוֹ','U+05B9','&#1465;'),
('Shuruk','שורוק','אוּ','U+05BC','&#1468;'),
('Kubutz','קובוץ','אֻ','U+05BB','&#1467;'),
('Sheva','שוה','אְ','U+05B0','&#1456;'),
('Chataf Petach','חטף פתח','אֲ','U+05B2','&#1458;'),
('Chataf Kamats','חטף קמץ','אֳ','U+05B3','&#1459;'),
('Chataf Segol','חטף סגול','אֱ','U+05B1','&#1457;'),
('Dagesh','דגש','בּ','U+05BC','&#1468;')
GO