 # coding=utf-8 
import requests
import json
import pprint
pp = pprint.PrettyPrinter(indent=4)


def get_and_print_data(url):
      r = requests.get(url)
      info = r.json()
      print('*************************************************************************')
      pp.pprint(info['query']['pages'])
      with open('./tanach_messora_text/Mishlei.txt','a',encoding='utf-8') as f :
         for key in info['query']['pages']:
            print(info['query']['pages'])
            result = str(info['query']['pages'][key]['cirrusbuilddoc']['text'])
            f.write(result+'\r\n')
      f.close() 




#listNumbers = ['א','ב','ג','ד','ה','ו','ז','ח','ט','י','יא','יב','יג','יד','טו','טז','יז','יח','יט','כ','כא','כב','כג','כד','כה','כו','כז','כח','כט','ל','לא','לב','לג','לד','לה','לו','לז','לח','לט','מ','מא','מב','מג','מד','מה','מו','מז','מח','מט','נ','נא','נב','נג','נד','נה','נו','נז','נח','נט','ס','סא','סב','סג','סד','סה','סו','סז','סח','סט','ע','עא','עב','עג','עד','עה','עו','עז','עח','עט','פ','פא','פב','פג','פד','פה','פו','פז','פח','פט','צ','צא','צב','צג','צד','צה','צו','צז','צח','צט','ק','קא','קב','קג','קד','קה','קו','קז','קח','קט','קי','קיא','קיב','קיג','קיד','קטו','קטז','קיז','קיח','קיט','קכ','קכא','קכב','קכג','קכד','קכה','קכו','קכז','קכח','קכט','קל','קלא','קלב','קלג','קלד','קלה','קלו','קלז','קלח','קלט','קמ','קמא','קמב','קמג','קמד','קמה','קמו','קמז','קמח','קמט','קנ']

listNumbers = ["א","ב","ג",'ד','ה','ו','ז','ח','ט','י','יא','יב','יג','יד','טו','טז','יז','יח','יט','כ','כא','כב','כג','כד','כה','כו','כז','כח','כט','ל','לא']

for number in listNumbers:
      listOfChapters='https://he.wikisource.org/w/api.php?action=query&titles=משלי_{}/טעמים&prop=cirrusbuilddoc&format=json&origin=*'.format(number)
      get_and_print_data(listOfChapters)