USE KiMeTzion;

INSERT INTO dbo.TBL_REF_TAAM
VALUES 
('׃',N'סוֹף פָּסֽוּק',N'סוֹף פָּסֽוּק',N'סִלּֽוּק',N'Sof pasuk / siluk',N'U+05C3',N'&#1475;'),
(N'ב֑',N'אֶתְנַחְתָּ֑א',N'אַתְנָ֑ח',N'אֶתְּנָ֑חָא',N'Atnaḥ / Etnahta',N'U+0591',N'&#1425;'),
(N'ב֒',N'סֶגּוֹל֒',N'סְגוֹלְתָּא֒',N'סְגֻלְתָּא֒',N'Segolta',N'U+0592',N'&#1426;'),
(N'ב֓',N'שַׁלְשֶׁ֓לֶת',N'שַׁלְשֶׁ֓לֶת',N'שַׁלְשֶׁ֓לֶת',N'Shalshelet',N'U+0593',N'&#1427;'),
(N'ב֔',N'זָקֵף קָטָ֔ן',N'זָקֵף קָט֔וֹן',N'זָקֵף קָטָ֔ן',N'Zaqef qaton',N'U+0594',N'&#1428;'),
(N'ב֕',N'זָקֵף גָּד֕וֹל',N'זָקֵף גָּד֕וֹל',N'זָקֵף גָּד֕וֹל',N'Zaqef gadol',N'U+0595',N'&#1429;'),
(N'ב֖',N'טִפְחָ֖א',N'טַרְחָ֖א',N'טִפְחָ֖א',N'Tarha',N'U+0596',N'&#1430;'),
(N'ב֗',N'רְבִ֗יע',N'רְבִ֗יע',N'רָבִ֗יעַ',N'Revia',N'U+0597',N'&#1431;'),
(N'ב֮',N'זַרְקָא֮',N'זַרְקָא֮',N'זִרְקָא֮',N'Zarqa / Zirqa',N'U+05AE',N'&#1454;'),
(N'ב֙',N'פַּשְׁטָא֙',N'קַדְמָא֙',N'פִשְׁטָא֙',N'Qadma / Pashta / Pishta',N'U+0599',N'&#1433;'),
(N'ב֨ב֙',N'שְׁנֵ֨י פַּשְׁטִין֙',N'תְּרֵ֨י קַדְמִין֙',N'תְּרֵ֨ין פִשְׁטִין֙',N'Tere qadmin / Shene pashtin / Tere Pishtin',N'U+0599',N'&#1448;'),
(N'ב֚',N'יְ֚תִיב',N'יְ֚תִיב',N'יְ֚תִיב מֻקְדָּם',N'Yetiv',N'U+059A',N'&#1434;'),
(N'ב֛',N'תְּבִ֛יר',N'תְּבִ֛יר',N'תַּבְרָ֛א',N'Tevir / Tavra',N'U+059B',N'&#1435;'),
(N'ב֡',N'פָּזֵ֡ר',N'פָּזֵר קָטָ֡ן',N'פָּזֵ֡ר',N'Pazer qatan / Pazer',N'U+05A1',N'&#1441;'),
(N'ב֟',N'קַרְנֵי פָרָ֟ה',N'קַרְנֵי פָרָ֟ה',N'קַרְנֵי פָרָ֟ה',N'Qarne farah',N'U+059F',N'&#1439;'),
(N'ב֠',N'תְּ֠לִישָא גְדוֹלָה',N'תִּ֠רְצָה',N'תִּלְשָׁא יָמִין',N'Tirtzah / Telisha gedolah / Tilsha yamin',N'U+05A0',N'&#1440;'),
(N'ב֜',N'אַזְלָא-גֵּ֜רֵשׁ',N'גְּרִ֜ישׁ',N'אָתֵּי',N'Gerish / Azla Geresh / Ate',N'U+059C',N'&#1436;'),
(N'ב֞',N'גֵּרְשַׁ֞יִם',N'שְׁנֵי גְרִישִׁ֞ין',N'תְּרֵין טִרְסִ֞ין',N'Shene gerishin / Gershayim / Terin tirsin',N'U+059E',N'&#1438;'),
(N'ב׀',N'מֻנַּח לְגַרְמֵ֣הּ',N'פָּסֵ֣ק',N'',N'Paseq / Munach legarmeh',N'U+05C0',N'&#1472;'),
(N'ב֥',N'מֵרְכָ֥א',N'מַאֲרִ֥יךְ',N'מַאֲרְכָ֥א',N'Maarich / Marcha',N'U+05A5',N'&#1445;'),
(N'ב֣',N'מֻנַּ֣ח',N'שׁוֹפָר הוֹלֵ֣ךְ',N'שׁוֹפָ֣ר הוֹלֵךְ',N'Shofar holech / Munach',N'U+05A3',N'&#1443;'),
(N'ב֤',N'מַהְפַּ֤ך',N'‏(שׁוֹפָר) מְהֻפָּ֤ךְ',N'שׁוֹפָ֤ר הָפוּךְ',N'(Shofar) mehuppach / Mahpach / Chofar Hafouch',N'U+05A4',N'&#1444;'),
(N'ב֧',N'דַּרְגָּ֧א',N'דַּרְגָּ֧א',N'דִּרְגָּ֧א',N'Darga / Dirga',N'U+05A7',N'&#1447;'),
(N'ב֨',N'קַדְמָ֨א',N'אַזְלָ֨א',N'אַזְלָ֨א',N'Azla / Qadma',N'U+05A8',N'&#1448;'),
(N'ב֩',N'תְּלִישָא קְטַנָּה֩',N'תַּלְשָׁא֩',N'תִּלְשָא֩ שְׂמֹאל',N'Talsha / Telisha qetannah / Tilsha smol',N'U+05A9',N'&#1449;'),
(N'ב֦',N'מֵרְכָא כְּפוּלָ֦ה',N'תְּרֵי טַעֲמֵ֦י',N'תְּרֵי טַעֲמֵ֦י',N'Tere ta’ame / Mercha kefula',N'U+05A6',N'&#1446;'),
(N'ב֪',N'יֵרֶח בֶּן יוֹמ֪וֹ',N'יֵרֶח בֶּן יוֹמ֪וֹ',N'יָרֵחַ בֶּן-יוֹמ֪וֹ',N'Yeraḥ ben yomo',N'U+05AA',N'&#1450;')
;