USE KiMeTzion
GO

INSERT INTO dbo.TBL_REF_TAAM
VALUES 
('׃',N'סוֹף פָּסֽוּק',N'סוֹף פָּסֽוּק',N'סִלּֽוּק','Sof pasuk / siluk','U+05C3','&#1475;'),
(N'ב֑',N'אֶתְנַחְתָּ֑א',N'אַתְנָ֑ח',N'אֶתְּנָ֑חָא','Atnaḥ / Etnahta','U+0591','&#1425;'),
(N'ב֒',N'סֶגּוֹל֒',N'סְגוֹלְתָּא֒',N'סְגֻלְתָּא֒','Segolta','U+0592','&#1426;'),
(N'ב֓',N'שַׁלְשֶׁ֓לֶת',N'שַׁלְשֶׁ֓לֶת',N'שַׁלְשֶׁ֓לֶת','Shalshelet','U+0593','&#1427;'),
(N'ב֔',N'זָקֵף קָטָ֔ן',N'זָקֵף קָט֔וֹן',N'זָקֵף קָטָ֔ן','Zaqef qaton','U+0594','&#1428;'),
(N'ב֕',N'זָקֵף גָּד֕וֹל',N'זָקֵף גָּד֕וֹל',N'זָקֵף גָּד֕וֹל','Zaqef gadol','U+0595','&#1429;'),
(N'ב֖',N'טִפְחָ֖א',N'טַרְחָ֖א',N'טִפְחָ֖א','Tarha','U+0596','&#1430;'),
(N'ב֗',N'רְבִ֗יע',N'רְבִ֗יע',N'רָבִ֗יעַ','Revia','U+0597','&#1431;'),
(N'ב֮',N'זַרְקָא֮',N'זַרְקָא֮',N'זִרְקָא֮','Zarqa / Zirqa','U+05AE','&#1454;'),
(N'ב֙',N'פַּשְׁטָא֙',N'קַדְמָא֙',N'פִשְׁטָא֙','Qadma / Pashta / Pishta','U+0599','	&#1433;'),
(N'ב֨ב֙',N'שְׁנֵ֨י פַּשְׁטִין֙',N'תְּרֵ֨י קַדְמִין֙',N'תְּרֵ֨ין פִשְׁטִין֙','Tere qadmin / Shene pashtin / Tere Pishtin','U+0599','&#1448;'),
(N'ב֚',N'יְ֚תִיב',N'יְ֚תִיב',N'יְ֚תִיב מֻקְדָּם','Yetiv','U+059A','&#1434;'),
(N'ב֛',N'תְּבִ֛יר',N'תְּבִ֛יר',N'תַּבְרָ֛א','Tevir / Tavra','U+059B','&#1435;'),
(N'ב֡',N'פָּזֵ֡ר',N'פָּזֵר קָטָ֡ן',N'פָּזֵ֡ר','Pazer qatan / Pazer','U+05A1','	&#1441;'),
(N'ב֟',N'קַרְנֵי פָרָ֟ה',N'קַרְנֵי פָרָ֟ה',N'קַרְנֵי פָרָ֟ה','Qarne farah','U+059F','	&#1439;'),
(N'ב֠',N'תְּ֠לִישָא גְדוֹלָה',N'תִּ֠רְצָה',N'תִּלְשָׁא יָמִין','Tirtzah / Telisha gedolah / Tilsha yamin','U+05A0','	&#1440;'),
(N'ב֜',N'אַזְלָא-גֵּ֜רֵשׁ',N'גְּרִ֜ישׁ',N'אָתֵּי','Gerish / Azla Geresh / Ate','',''),
(N'ב֞',N'גֵּרְשַׁ֞יִם',N'שְׁנֵי גְרִישִׁ֞ין',N'תְּרֵין טִרְסִ֞ין','Shene gerishin / Gershayim / Terin tirsin','U+059E','&#1438;'),
(N'ב׀',N'מֻנַּח לְגַרְמֵ֣הּ',N'פָּסֵ֣ק','','Paseq / Munach legarmeh','U+05C0','&#1472;'),
(N'ב֥',N'מֵרְכָ֥א',N'מַאֲרִ֥יךְ',N'מַאֲרְכָ֥א','Maarich / Marcha','U+05A5','&#1445;'),
(N'ב֣',N'מֻנַּ֣ח',N'שׁוֹפָר הוֹלֵ֣ךְ',N'שׁוֹפָ֣ר הוֹלֵךְ','Shofar holech / Munach','U+05A3','&#1443;'),
(N'ב֤',N'מַהְפַּ֤ך',N'‏(שׁוֹפָר) מְהֻפָּ֤ךְ',N'שׁוֹפָ֤ר הָפוּךְ','(Shofar) mehuppach / Mahpach / Chofar Hafouch','U+05A4','&#1444;'),
(N'ב֧',N'דַּרְגָּ֧א',N'דַּרְגָּ֧א',N'דִּרְגָּ֧א','Darga / Dirga','U+05A7','&#1447;'),
(N'ב֨',N'קַדְמָ֨א',N'אַזְלָ֨א',N'אַזְלָ֨א','Azla / Qadma','U+05A8','&#1448;'),
(N'ב֩',N'תְּלִישָא קְטַנָּה֩',N'תַּלְשָׁא֩',N'תִּלְשָא֩ שְׂמֹאל','Talsha / Telisha qetannah / Tilsha smol','U+05A9','	&#1449;'),
(N'ב֦',N'מֵרְכָא כְּפוּלָ֦ה',N'תְּרֵי טַעֲמֵ֦י',N'תְּרֵי טַעֲמֵ֦י','Tere ta’ame / Mercha kefula','U+05A6','&#1446;'),
(N'ב֪',N'יֵרֶח בֶּן יוֹמ֪וֹ',N'יֵרֶח בֶּן יוֹמ֪וֹ',N'יָרֵחַ בֶּן-יוֹמ֪וֹ','Yeraḥ ben yomo','U+05AA','&#1450;')
GO