marker_mishna1 = ": מתני'"
marker_mishna2 = "^מתני'"
marker_gemara = "גמ'"

massechet = \
    ("01" , 64 , 1 , "berachot" , "ברכות" )\
    ,("02" , 157 , 2 , "shabbat" , "שבת" )\
    ,("03" , 105 , 1 , "eruvin" , "עירובין" )\
    ,("04" , 121 , 2 , "psachim" , "פסחים" )\
    ,("05" , 22 , 2 , "shekalim" , "שקלים" )\
    ,("06" , 88 , 1 , "yiuma" , "יומא" )\
    ,("07" , 56 , 2 , "sukah" , "סוכה" )\
    ,("08" , 40 , 2 , "beitzah" , "ביצה" )\
    ,("09" , 35 , 1 , "rosh_hashanah" , "ראש השנה" )\
    ,("10" , 31 , 1 , "taanit" , "תענית" )\
    ,("11" , 32 ,  1 , "megilah" , "מגילה" )\
    ,("12" , 29 , 1 , "moed_katan" , "מועד קטן" )\
    ,("13" , 27 , 1 , "chagiga" , "חגיגה" )\
    ,("14" , 122 , 1 , "yevamot" , "יבמות" )\
    ,("15" , 112 , 2 , "ktuvot" , "כתובות" )\
    ,("16" , 91 , 2 , "nedarim" , "נדרים" )\
    ,("17" , 66 , 2 , "nazir" , "נזיר" )\
    ,("18" , 49 , 2 , "sotah" , "סוטה" )\
    ,("19" , 90 , 1 , "gitin" , "גיטין" )\
    ,("20" , 82 , 2 , "kidushing" , "קידושין" )\
    ,("21" , 119 , 2 , "bava_kama" , "בבא קמא" )\
    ,("22" , 119 , 1 , "bava_metzia" , "בבא מציעא" )\
    ,("23" , 176 , 2 ,  "bava_batra" , "בבא בתרא" )\
    ,("24" , 113 , 2 , "sanhedrin" , "סנהדרין" )\
    ,("25" , 24 , 2 , "makot" , "מכות" )\
    ,("26" , 49 , 2 , "shavuot" , "שבועות" )\
    ,("27" , 76 , 2 , "avoda_zarah" , "עבודה זרה" )\
    ,("28" , 14 , 1 , "horaiot" , "הוריות" )\
    ,("29" , 120 , 2 , "zevachim" , "זבחים" )\
    ,("30" , 110 , 1 , "menachot" ,"מנחות" )\
    ,("31" , 142 , 1 , "chulin" , "חולין" )\
    ,("32" , 61 , 1 ,  "bechorot" , "בכורות" )\
    ,("33" , 34 , 1 , "arachin" , "ערכין" )\
    ,("34" , 34 , 1 , "temurah" , "תמורה" )\
    ,("35" , 28 , 2 , "kritut" , "כריתות" )\
    ,("36" , 22 , 1 , "meilah" , "מעילה" )\
    ,("37" , 73 , 1 , "nidah" , "נידה" )

prakim = \
("arachin","2","1","7","2","הכל מעריכין") \
,("arachin","7","2","13","2","אין נערכין") \
,("arachin","13","2","17","1","יש בערכין") \
,("arachin","17","1","19","1","השג יד") \
,("arachin","19","1","21","2","האומר משקלי") \
,("arachin","21","2","24","1","שום היתומים") \
,("arachin","24","1","27","1","אין מקדישין") \
,("arachin","27","1","29","1","המקדיש שדהו") \
,("arachin","29","1","34","1","המוכר שדהו") \
,("avoda_zarah","2","1","22","1","לפני אידיהן") \
,("avoda_zarah","22","1","40","2","אין מעמידין") \
,("avoda_zarah","40","2","49","2","כל הצלמים") \
,("avoda_zarah","49","2","61","2","רבי ישמעאל") \
,("avoda_zarah","61","2","76","2","השוכר את הפועל") \
,("bava_batra","2","1","17","1","השותפין") \
,("bava_batra","17","1","27","2","לא יחפור") \
,("bava_batra","27","2","60","2","חזקת הבתים") \
,("bava_batra","60","2","73","1","המוכר את הבית") \
,("bava_batra","73","1","91","2","המוכר את הספינה") \
,("bava_batra","91","2","102","2","המוכר פירות") \
,("bava_batra","102","2","108","1","בית כור") \
,("bava_batra","108","1","139","2","יש נוחלין") \
,("bava_batra","139","2","159","2","מי שמת") \
,("bava_batra","159","2","176","2","גט פשוט ") \
,("bava_kama","2","1","17","1","ארבעה אבות") \
,("bava_kama","17","1","27","1","כיצד הרגל") \
,("bava_kama","27","1","36","1","המניח") \
,("bava_kama","36","1","46","1","שור שנגח ארבעה וחמשה") \
,("bava_kama","46","1","55","1","שור שנגח את הפרה") \
,("bava_kama","55","1","62","2","הכונס") \
,("bava_kama","62","2","83","1","מרובה") \
,("bava_kama","83","1","93","1","החובל") \
,("bava_kama","93","1","111","1","הגוזל עצים") \
,("bava_kama","111","1","119","2","הגוזל בתרא ") \
,("bava_metzia","2","1","21","1","שנים אוחזין") \
,("bava_metzia","21","1","33","2","אלו מציאות") \
,("bava_metzia","33","2","44","1","המפקיד") \
,("bava_metzia","44","1","60","2","הזהב") \
,("bava_metzia","60","2","75","2","איזהו נשך") \
,("bava_metzia","75","2","83","1","השוכר את האומנין") \
,("bava_metzia","83","1","94","1","השוכר את הפועלים") \
,("bava_metzia","94","1","103","1","השואל") \
,("bava_metzia","103","1","116","1","המקבל") \
,("bava_metzia","116","2","119","1","הבית והעלייה") \
,("bechorot","2","1","13","1","הלוקח עובר חמורו") \
,("bechorot","13","1","19","2","הלוקח עובר פרתו") \
,("bechorot","19","2","26","2","הלוקח בהמה") \
,("bechorot","26","2","31","1","עד כמה ישראל חייבין") \
,("bechorot","31","1","37","1","כל פסולי המוקדשין") \
,("bechorot","37","1","43","1","על אלו מומין") \
,("bechorot","43","1","46","1","מומין אלו") \
,("bechorot","46","1","52","2","יש בכור") \
,("bechorot","52","2","61","1","מעשר בהמה") \
,("beitzah","2","1","15","1","ביצה") \
,("beitzah","15","1","23","2","יום טוב") \
,("beitzah","23","2","29","2","אין צדין") \
,("beitzah","29","2","35","2","המביא") \
,("beitzah","35","2","40","2","משילין פירות ") \
,("berachot","2","1","13","1","מאימתי") \
,("berachot","13","1","17","2","היה קורא") \
,("berachot","17","2","26","1","מי שמתו") \
,("berachot","26","1","30","2","תפלת השחר") \
,("berachot","30","2","34","2","אין עומדין") \
,("berachot","34","2","45","1","כיצד מברכין") \
,("berachot","45","1","51","2","שלשה שאכלו") \
,("berachot","51","2","53","2","אלו דברים") \
,("berachot","53","2","64","1","הרואה ") \
,("chagiga","2","1","11","2","הכל חייבין") \
,("chagiga","11","2","20","2","אין דורשין") \
,("chagiga","20","2","27","1","חומר בקודש ") \
,("chulin","2","1","26","2","הכל שוחטין") \
,("chulin","26","2","42","1","השוחט") \
,("chulin","42","1","67","2","אלו טרפות") \
,("chulin","67","2","78","1","בהמה המקשה") \
,("chulin","78","1","83","2","אותו ואת בנו") \
,("chulin","83","2","89","2","כסוי הדם") \
,("chulin","89","2","103","2","גיד הנשה") \
,("chulin","103","2","117","2","כל הבשר") \
,("chulin","117","2","129","2","העור והרוטב") \
,("chulin","129","2","134","2","הזרוע והלחיים") \
,("chulin","134","2","138","2","ראשית הגז") \
,("chulin","138","2","142","1","שילוח הקן ") \
,("gitin","2","1","15","1","המביא קמא") \
,("gitin","15","1","24","1","המביא גט") \
,("gitin","24","1","32","1","כל הגט") \
,("gitin","32","1","48","2","השולח") \
,("gitin","48","2","62","1","הניזקין") \
,("gitin","62","1","67","2","האומר") \
,("gitin","67","2","77","1","מי שאחזו") \
,("gitin","77","1","82","1","הזורק") \
,("gitin","82","1","90","2","המגרש") \
,("horaiot","2","1","6","2","הורו בית דין") \
,("horaiot","6","2","9","2","הורה כהן משיח") \
,("horaiot","9","2","14","1","כהן משיח ") \
,("iruvin","2","1","17","2","מבוי") \
,("iruvin","17","2","26","2","עושין פסין") \
,("iruvin","26","2","41","2","בכל מערבין") \
,("iruvin","41","2","52","2","מי שהוציאוהו") \
,("iruvin","52","2","61","2","כיצד מעברין") \
,("iruvin","61","2","76","1","הדר") \
,("iruvin","76","1","82","1","חלון") \
,("iruvin","82","1","89","1","כיצד משתתפין") \
,("iruvin","89","1","95","1","כל גגות") \
,("iruvin","95","1","105","1","המוצא תפילין ") \
,("kidushing","2","1","41","1","האשה נקנית") \
,("kidushing","41","1","58","2","האיש מקדש") \
,("kidushing","58","2","69","1","האומר") \
,("kidushing","69","1","82","2","עשרה יוחסין ") \
,("kritut","2","1","8","2","שלשים ושש") \
,("kritut","8","2","11","2","ארבעה מחוסרי כפרה") \
,("kritut","11","2","17","1","אמרו לו") \
,("kritut","17","1","20","2","ספק אכל חלב") \
,("kritut","20","2","23","2","דם שחיטה") \
,("kritut","23","2","28","2","המביא אשם ") \
,("ktuvot","2","1","15","2","בתולה נשאת") \
,("ktuvot","15","2","28","2","האשה שנתארמלה") \
,("ktuvot","28","2","41","2","אלו נערות") \
,("ktuvot","41","2","54","2","נערה") \
,("ktuvot","54","2","65","2","אף על פי") \
,("ktuvot","65","2","70","1","מציאת האשה") \
,("ktuvot","70","1","77","2","המדיר את אשתו") \
,("ktuvot","77","2","82","2","האשה") \
,("ktuvot","82","2","90","1","הכותב לאשתו") \
,("ktuvot","90","1","95","2","מי שהיה נשוי") \
,("ktuvot","95","2","101","2","אלמנה ניזונת") \
,("ktuvot","101","2","104","2","הנושא") \
,("ktuvot","104","2","112","2","שני דייני גזירות ") \
,("makot","2","1","7","1","כיצד העדים") \
,("makot","7","1","13","1","אלו הן הגולין") \
,("makot","13","1","24","2","אלו הן הלוקין ") \
,("megilah","2","1","17","1","מגילה נקראת") \
,("megilah","17","1","21","1","הקורא למפרע") \
,("megilah","21","1","25","2","הקורא את המגילה עומד") \
,("megilah","25","2","32","1","בני העיר ") \
,("meilah","2","1","8","1","קדשי קדשים") \
,("meilah","8","1","10","2","חטאת העוף") \
,("meilah","10","2","14","2","ולד חטאת") \
,("meilah","14","2","18","1","קדשי מזבח") \
,("meilah","18","1","20","1","הנהנה") \
,("meilah","20","1","22","1","השליח שעשה שליחותו") \
,("menachot","2","1","13","1","כל המנחות") \
,("menachot","13","1","17","1","הקומץ את המנחה") \
,("menachot","17","1","38","1","הקומץ") \
,("menachot","38","1","52","2","התכלת") \
,("menachot","52","2","63","2","כל המנחות") \
,("menachot","63","2","72","2","רבי ישמעאל") \
,("menachot","72","2","76","2","אלו מנחות נקמצות") \
,("menachot","76","2","83","2","התודה היתה באה") \
,("menachot","83","2","87","1","כל קרבנות הצבור") \
,("menachot","87","1","94","1","שתי מדות") \
,("menachot","94","1","100","2","שתי הלחם") \
,("menachot","100","2","104","2","המנחות והנסכים") \
,("menachot","104","2","110","1","הרי עלי עשרון ") \
,("moed_katan","2","1","11","1","משקין בית השלחין") \
,("moed_katan","11","1","13","2","מי שהפך") \
,("moed_katan","13","2","29","1","ואלו מגלחין ") \
,("nazir","2","1","8","2","כל כנויי") \
,("nazir","8","2","16","1","הריני נזיר") \
,("nazir","16","1","20","2","מי שאמר") \
,("nazir","20","2","30","2","מי שאמר") \
,("nazir","30","2","34","1","בית שמאי") \
,("nazir","34","1","47","1","שלשה מינין") \
,("nazir","47","1","57","1","כהן גדול") \
,("nazir","57","1","61","1","שני נזירים") \
,("nazir","61","1","66","2","הכותים אין להם נזירות") \
,("nedarim","2","1","13","2","כל כנויי") \
,("nedarim","13","2","20","2","ואלו מותרין") \
,("nedarim","20","2","32","2","ארבעה נדרים") \
,("nedarim","32","2","45","1","אין בין המודר") \
,("nedarim","45","1","48","2","השותפין") \
,("nedarim","48","2","53","2","הנודר מן המבושל") \
,("nedarim","53","2","60","1","הנודר מן הירק") \
,("nedarim","60","1","63","2","קונם יין") \
,("nedarim","63","2","66","2","רבי אליעזר") \
,("nedarim","66","2","79","1","נערה המאורסה") \
,("nedarim","79","1","91","2","ואלו נדרים ") \
,("nidah","2","1","12","2","שמאי אומר") \
,("nidah","12","2","21","1","כל היד") \
,("nidah","21","1","31","2","המפלת חתיכה") \
,("nidah","31","2","39","2","בנות כותים") \
,("nidah","39","2","48","1","יוצא דופן") \
,("nidah","48","1","54","2","בא סימן") \
,("nidah","54","2","57","1","דם הנדה") \
,("nidah","57","1","59","1","הרואה כתם") \
,("nidah","59","1","64","2","האשה") \
,("nidah","64","2","73","1","תינוקת ") \
,("psachim","2","1","21","1","אור לארבעה עשר") \
,("psachim","21","1","42","1","כל שעה") \
,("psachim","42","1","50","1","אלו עוברין") \
,("psachim","50","1","57","2","מקום שנהגו") \
,("psachim","57","2","65","2","תמיד נשחט") \
,("psachim","65","2","73","2","אלו דברים") \
,("psachim","73","2","86","2","כיצד צולין") \
,("psachim","86","2","92","2","האשה") \
,("psachim","92","2","99","1","מי שהיה טמא ") \
,("psachim","99","2","121","2","ערבי פסחים") \
,("rosh_hashanah","2","1","22","1","ארבעה ראשי שנים") \
,("rosh_hashanah","22","1","25","2","אם אינן מכירין") \
,("rosh_hashanah","25","2","29","2","ראוהו בית דין") \
,("rosh_hashanah","29","2","35","1","יום טוב ") \
,("sanhedrin","2","1","18","1","דיני ממונות") \
,("sanhedrin","18","1","22","2","כהן גדול") \
,("sanhedrin","22","2","31","2","זה בורר") \
,("sanhedrin","31","2","39","2","אחד דיני ממונות") \
,("sanhedrin","39","2","42","1","היו בודקין") \
,("sanhedrin","42","1","49","1","נגמר הדין") \
,("sanhedrin","49","1","68","1","ארבע מיתות") \
,("sanhedrin","68","1","75","1","בן סורר ומורה") \
,("sanhedrin","75","1","84","1","אלו הן הנשרפין") \
,("sanhedrin","84","1","90","1","אלו הן הנחנקין") \
,("sanhedrin","90","1","113","2","כל ישראל יש להם חלק ") \
,("shabbat","2","1","20","2","יציאות השבת") \
,("shabbat","20","2","36","2","במה מדליקין") \
,("shabbat","36","2","47","2","כירה") \
,("shabbat","47","2","51","2","במה טומנין") \
,("shabbat","51","2","56","2","במה בהמה") \
,("shabbat","56","2","67","2","במה אשה") \
,("shabbat","67","2","76","2","כלל גדול") \
,("shabbat","76","2","82","1","המוציא יין") \
,("shabbat","82","1","90","2","אמר רבי עקיבא") \
,("shabbat","90","2","96","1","המצניע") \
,("shabbat","96","1","102","1","הזורק") \
,("shabbat","102","1","105","1","הבונה") \
,("shabbat","105","1","107","1","האורג") \
,("shabbat","107","1","111","2","שמנה שרצים") \
,("shabbat","111","2","115","1","ואלו קשרים") \
,("shabbat","115","1","122","2","כל כתבי") \
,("shabbat","122","2","126","2","כל הכלים") \
,("shabbat","126","2","129","2","מפנין") \
,("shabbat","129","2","137","2","רבי אליעזר דמילה") \
,("shabbat","137","2","141","2","תולין") \
,("shabbat","141","2","143","1","נוטל אדם את בנו") \
,("shabbat","143","1","148","1","חבית") \
,("shabbat","148","1","153","1","שואל") \
,("shabbat","153","1","157","2","מי שהחשיך ") \
,("shavuot","2","1","14","1","שבועות שתים") \
,("shavuot","14","1","19","2","ידיעות הטומאה") \
,("shavuot","19","2","29","2","שבועות שתים") \
,("shavuot","29","2","36","2","שבועת העדות") \
,("shavuot","36","2","38","2","שבועת הפקדון") \
,("shavuot","38","2","44","2","שבועת הדיינין") \
,("shavuot","44","2","49","1","כל הנשבעין") \
,("shavuot","49","1","49","2","ארבעה שומרין ") \
,("shekalim","2","1","5","1","פרק באחד באדר") \
,("shekalim","5","1","7","2","מצרפין שקלים") \
,("shekalim","7","2","9","2","פרק בשלשה פרקים") \
,("shekalim","9","2","13","1","פרק התרומה") \
,("shekalim","13","1","15","2","פרק אלו הן הממונין") \
,("shekalim","15","2","19","1","פרק יג שופרות") \
,("shekalim","19","1","21","1","פרק מעות שנמצאו") \
,("shekalim","21","1","22","2","פרק כל הרוקין ") \
,("sotah","2","1","14","1","המקנא לאשתו") \
,("sotah","14","1","19","1","היה מביא") \
,("sotah","19","1","23","2","היה נוטל") \
,("sotah","23","2","27","2","ארוסה") \
,("sotah","27","2","31","1","כשם שהמים") \
,("sotah","31","1","32","1","מי שקינא") \
,("sotah","32","1","42","1","אלו נאמרין") \
,("sotah","42","1","44","2","משוח מלחמה") \
,("sotah","44","2","49","2","עגלה ערופה ") \
,("sukah","2","1","20","2","סוכה") \
,("sukah","20","2","29","2","הישן") \
,("sukah","29","2","42","2","לולב הגזול") \
,("sukah","42","2","50","1","לולב וערבה") \
,("sukah","50","1","56","2","החליל ") \
,("taanit","2","1","15","1","מאימתי") \
,("taanit","15","1","18","2","סדר תעניות כיצד") \
,("taanit","18","2","26","1","סדר תעניות אלו") \
,("taanit","26","1","31","1","בשלשה פרקים ") \
,("temurah","2","1","13","2","הכל ממירין") \
,("temurah","13","2","17","2","יש בקרבנות") \
,("temurah","17","2","21","2","אלו קדשים") \
,("temurah","21","2","24","1","ולד חטאת") \
,("temurah","24","1","27","2","כיצד מערימין") \
,("temurah","27","2","31","1","כל האסורין") \
,("temurah","31","1","34","1","יש בקדשי מזבח ") \
,("yevamot","2","1","17","1","חמש עשרה נשים") \
,("yevamot","17","1","26","1","כיצד אשת אחיו") \
,("yevamot","26","1","35","1","ארבעה אחין") \
,("yevamot","35","1","50","1","החולץ") \
,("yevamot","50","1","53","2","רבן גמליאל") \
,("yevamot","53","2","66","1","הבא על יבמתו") \
,("yevamot","66","1","70","1","אלמנה") \
,("yevamot","70","1","84","1","הערל") \
,("yevamot","84","1","87","2","יש מותרות") \
,("yevamot","87","2","97","1","האשה רבה") \
,("yevamot","97","1","101","1","נושאין על האנוסה") \
,("yevamot","101","1","106","2","מצות חליצה") \
,("yevamot","106","2","112","2","בית שמאי") \
,("yevamot","112","2","114","2","חרש") \
,("yevamot","114","2","118","2","האשה שלום") \
,("yevamot","119","1","122","1","האשה בתרא") \
,("yiuma","2","1","21","2","שבעת ימים") \
,("yiuma","21","2","28","1","בראשונה") \
,("yiuma","28","1","39","1","אמר להם הממונה") \
,("yiuma","39","1","46","2","טרף בקלפי") \
,("yiuma","46","2","62","1","הוציאו לו") \
,("yiuma","62","1","68","2","שני שעירי") \
,("yiuma","68","2","73","2","בא לו כהן גדול") \
,("yiuma","73","2","88","1","יום הכפורים") \
,("zevachim","2","1","15","2","כל הזבחים") \
,("zevachim","15","2","31","2","כל הזבחים שקבלו דמן") \
,("zevachim","31","2","36","2","כל הפסולין") \
,("zevachim","36","2","47","1","בית שמאי") \
,("zevachim","47","1","57","2","איזהו מקומן") \
,("zevachim","57","2","66","1","קדשי קדשים") \
,("zevachim","66","1","70","2","חטאת העוף") \
,("zevachim","70","2","83","1","כל הזבחים שנתערבו") \
,("zevachim","83","1","88","2","המזבח מקדש") \
,("zevachim","88","2","92","1","כל התדיר") \
,("zevachim","92","1","98","2","דם חטאת") \
,("zevachim","98","2","106","1","טבול יום") \
,("zevachim","106","1","112","1","השוחט והמעלה") \
,("zevachim","112","1","120","2","פרת חטאת ")